$(document).ready(function(){
	

	$('.main-nav .main-nav__link').mPageScroll2id({
		offset: 50
	});// Плавный скролл привязан к ссылкам
		
	$('.main-nav__icon').on('click', function() {
		$(this).closest('.main-nav').toggleClass('main-nav_state_open');
	});
	
	$('.main-nav__link').on('click', function() {
		$(this).closest('.main-nav').removeClass('main-nav_state_open');
	});

    $('.slider__inner').slick({
        dots: true,
        arrow: true,
        infinite: true,
        speed: 500,
        fade: true,
        cssEase: 'linear'
    });

	$('.language__item').on('click', function() {
		$('.language__item.active').removeClass('active');
	});
	$('.language__item').on('click', function() {
		$(this).toggleClass('active');
		loadLocal();
		loadLocalLink();
	});

	function loadLocal() {
		var element = document.getElementsByClassName('active')[0];
		var widgetName = element.getAttribute('data-local-name');
		var targetLocal = local[widgetName];
		var localValue = document.getElementsByClassName('local');
		for (var i = 0; i < localValue.length; i++) {
			var key = localValue[i].getAttribute('data-local');
			localValue[i].innerHTML = targetLocal[key];
		}
	}

	function loadLocalLink() {
		var element = document.getElementsByClassName('active')[0];
		var widgetName = element.getAttribute('data-local-name');
		var targetLocalLink = localLink[widgetName];
		var localLinkValue = document.getElementsByClassName('local-link');
		for (var i = 0; i < localLinkValue.length; i++) {
			var key = localLinkValue[i].getAttribute('data-local');
			localLinkValue[i].setAttribute('href',targetLocalLink[key]);
		}
	}
	
	var local = {
		ru: {
			"home-page": "Главная",
			"about-us": "О нас",
			"our-activity": "Наша деятельность",
			"contacts": "Контакты",
			"quote": "\"Я надеюсь, мы с вами пожмем друг другу руки в эпоху, когда победа над возрастом станет реальностью - когда мы сможем наслаждаться необыкновенно долгой жизнью, сохраняя на всем ее протяжении здоровье и силы, когда призрак неизбежной старости рассеется под солнцем вечной молодости.\"",
			"quote-author": "- Обри де Грей - Разработчик концепции",
			"about-us-description": "Bioengineering Clarion — некоммерческая организация, деятельность которой направлена на исследования и распространения информации в области продления жизни.",
			"about-us-mission": "С точки зрения нашей организации, нет ничего важнее, чем окончательная победа над биологическими факторами, разрушающими наш организм. Мы считаем, что борьба с болезнями, старением и в конечном итоге смертью, должна быть направляющим вектором всего человечества.",
			"about-us-concept": "Ознакомьтесь с нашей концепцией, перейдя по ",
			"medium-link": "ссылке.",
			"popularization": "Популяризация",
			"popularization-text": "Создание благоприятного общественного настроения в отношении борьбы со старением.  Мы планируем агрегировать новости, делать переводы и обзоры наиболее значимых публикаций и выступлений на конференциях. Рассматриваем возможность проводить встречи с докладами и презентациями, освещающими актуальный научный прогресс.",
			"development": "Разработка",
			"development-text": "Мы разрабатываем веб-ресурс и планируем интегрировать в него сервисы, связанные с биомаркерами, медицинской диагностикой и аналитикой активности исследовательских центров.",
			"research": "Исследования",
			"research-text": "Широкая сфера применения глубоких нейронных сетей открывает огромные возможности в исследовании процессов старения. Исследовательскую команду возглавляет Data Science инженер. В ближайшее время мы планируем начать решать реальные задачи, связанные с данными в области биогеронтологии.",
			"our-products": "Наши достижения",
			"bot-heading": "Bioengineering Clarion Diagnostic - телеграм бот",
			"bot-link": "Bioengineering Clarion Diagnostic",
			"bot-text": " - телеграмм бот, на базе сверточного нейронной сети. Простой в использовании сервис, предназначенный для распознавания и классификации образований на коже по фото. Имеет локализацию и доступный интерфейс. Предоставленная ботом информация дает повод внимательнее следить за здоровьем и мотивирует обратиться к врачу для предупреждения заболеваний кожи. На текущий момент мы выделяем следующие направления развития: внедрить английский локализацию; повышать точность результатов для фото с невысоким качеством; улучшить производительность; добавлять новые диагностики. Данный продукт разработан для каждого, кто заботится о своем здоровье.",
			"telegram-channel-heading": "Bioengineering Clarion - телеграм канал",
			"channel-text-about": "В канале публикуются актуальные новости в области биоинженерии в 9:30 и в 19:00 (UTC +3). Новости агрегируются в удобной для ознакомления форме, благодаря этому сложная информация становится доступна любому человеку. С нами вы сможете узнавать самые интересные открытия о здоровье и продлении жизни.",
			"channel-text": "Подписывайтесь на наш ",
			"channel-text-link": "телеграм канал",
			"channel-text-continuation": " и не забудьте его закрепить вверху, чтобы не пропустить важную информацию.",
			"video-heading": "Перевод и дубляж докладов с конференции \"Undoing Aging 2019\"",
			"youtube-text": "У вас есть уникальная возможность посмотреть доклады на русском языке на нашем ",
			"youtube-link": "youtube канале.",
			"video-text": "\"Undoing Aging\" - это самая авторитетная ежегодная научная конференция по радикальным методам борьбы со старением, проходящая в Берлине. На ней собираются ученые-биогеронтологи со всего мира и делятся информацией о самых последних исследованиях и разработках.",
			"trello-heading": "Bioengineering Clarion Tasks - публичная система управления задачами",
			"task-text": "Природа и сложность проблем, препятствующих радикальному продлению жизни и победе над старением, указывает на необходимость консолидации действий для их преодоления. Если вы хотите быть причастным к чему-то важному, разделяете наше видение и готовы действовать - начните сейчас.",
			"trello-text": "Мы предлагаем публичную ",
			"trello-link": "\"доску task’ов\"",
			"trello-text-continuation": ", в которой будем размещать текущие идеи и инициативы. Будем благодарны за воплощение в жизнь любого из предложенных заданий.",
			"instruction-text": "Ознакомьтесь с ",
			"trello-instruction-link": "инструкцией",
			"instruction-text-continuation": ", чтобы быстро разобраться в простом интерфейсе и выполнить свой первый \"task\". Чип и Дейл спешат на помощь, а ты?",
			"contacts-text": "Спасибо, за ваш интерес к Bioengineering Clarion. Вы можете связаться с нами, используя информацию ниже. Чтобы получать последние обновления, присоединяйтесь к нам в социальных сетях.",
			"email-text": "По всем вопросам пишите по адресу",
		},
		ua: {
			"home-page": "Головна",
			"about-us": "Про нас",
			"our-activity": "Наша діяльність",
			"contacts": "Контакти",
			"quote": "\"Я сподіваюся, ми з вами потиснемо один одному руки в епоху, коли перемога над віком стане реальністю - коли ми зможемо насолоджуватися надзвичайно довгим життям, зберігаючи протягом усього нього здоров'я і сили, коли привид неминучої старості розсіється під сонцем вічної молодості.\"",
			"quote-author": "- Обрі де Грей - Розробник концепції",
			"about-us-description": "Bioengineering Clarion — некомерційна організація, діяльність якої спрямована на дослідження і поширення інформації в області продовження життя.",
			"about-us-mission": "З точки зору нашої організації, немає нічого важливішого, ніж остаточна перемога над біологічними факторами, які руйнують наш організм. Ми вважаємо, що боротьба з хворобами, старінням і в кінцевому підсумку смертю, повинна бути напрямним вектором всього людства.",
			"about-us-concept": "Ознайомтеся з нашою концепцією, перейшовши за ",
			"medium-link": "посиланням.",
			"popularization": "Популяризація",
			"popularization-text": "Створення сприятливого суспільного настрою щодо боротьби зі старінням. Ми плануємо агрегувати новини, робити переклади та огляди найбільш важливих публікацій і виступів на конференціях. Розглядаємо можливість проводити зустрічі з доповідями і презентаціями, які висвітлюють актуальний науковий прогрес.",
			"development": "Розробка",
			"development-text": "Ми розробляємо веб-ресурс і плануємо інтегрувати в нього сервіси, пов'язані з біомаркерами, медичною діагностикою та аналітикою активності дослідницьких центрів.",
			"research": "Дослідження",
			"research-text": "Широка сфера застосування глибоких нейронних мереж відкриває величезні можливості в дослідженні процесів старіння. Дослідницьку команду очолює Data Science інженер. Найближчим часом ми плануємо почати вирішувати реальні завдання, пов'язані з даними в області біогеронтологіі.",
			"our-products": "Наші досягнення",
			"bot-heading": "Bioengineering Clarion Diagnostic - телеграм бот",
			"bot-link": "Bioengineering Clarion Diagnostic",
			"bot-text": " - телеграм бот, на базі згорткової нейронної мережі. Простий у користуванні сервіс, призначений для розпізнавання і класифікації утворень на шкірі по фото. Має локалізацію та доступний інтерфейс. Надана ботом інформація дає привід уважніше стежити за здоров'ям і мотивує звернутися до лікаря для попередження захворювань шкіри. На поточний момент ми виділяємо такі напрямки розвитку: впровадити англійську локалізацію; підвищувати точність результатів для фото з невисокою якістю; покращити продуктивність; додавати нові діагностики. Даний продукт розроблений для кожного, хто турбується про своє здоров'я.",
			"telegram-channel-heading": "Bioengineering Clarion - телеграм канал",
			"channel-text-about": "У каналі публікуються актуальні новини в області біоінженерії о 9:30 і о 19:00 (UTC +3). Новини агрегуються в зручній для ознайомлення формі, завдяки цьому складна інформація стає доступна будь-якій людині. З нами ви зможете дізнаватися найцікавіші відкриття про здоров'я і продовження життя.",
			"channel-text": "Підписуйтеся на наш ",
			"channel-text-link": "телеграм канал",
			"channel-text-continuation": " і не забудьте його закріпити вгорі, щоб не пропустити важливу інформацію.",
			"youtube-text": "У вас є унікальна можливість подивитися доповіді російською мовою на нашому ",
			"youtube-link": "youtube каналі.",
			"video-heading": "Переклад і дубляж доповідей з конференції \"Undoing Aging 2019\"",
			"video-text": "\"Undoing Aging\" - це найавторитетніша щорічна наукова конференція з радикальних методів боротьби зі старінням, що проходить в Берліні. На ній збираються вчені-біогеронтологи з усього світу і діляться інформацією про самі останні дослідження і розробки.",
			"trello-heading": "Bioengineering Clarion Tasks - публічна система управління завданнями",
			"task-text": "Природа і складність проблем, що перешкоджають радикальному продовженню життя і перемозі над старінням, вказує на необхідність консолідації дій для їх подолання. Якщо ви хочете бути причетним до чогось важливого, поділяєте наше бачення і готові діяти - почніть зараз.",
			"trello-text": "Ми пропонуємо публічну ",
			"trello-link": "\"дошку task'ів\"",
			"trello-text-continuation": ", в якій будемо розміщувати поточні ідеї і ініціативи. Будемо вдячні за втілення в життя будь-якого із запропонованих завдань.",
			"instruction-text": "Ознайомтеся з ",
			"trello-instruction-link": "інструкцією",
			"instruction-text-continuation": ", щоб швидко розібратися в простому інтерфейсі і виконати свій перший \"task\". Чіп і Дейл поспішають на допомогу, а ти?",
			"contacts-text": "Дякуємо, за вашу зацікавленість до Bioengineering Clarion. Ви можете зв'язатися з нами, використовуючи інформацію нижче. Щоб отримувати останні оновлення, приєднуйтесь до нас в соціальних мережах.",
			"email-text": "Зі всіма питаннями пишіть на адресу",
		}
	}
	var localLink = {
		ru: {
			"medium-link": "https://medium.com/@bioengineering.clarion/%D0%B3%D0%BE%D1%80%D0%BD-adf2dc06befe",
			"trello-link": "https://trello.com/b/uGMdwHLB/bioengineering-clarion",
			"trello-instruction-link": "https://medium.com/@bioengineering.clarion/public-task-management-system-e9e37ec70848"
		},
		ua: {
			"medium-link": "https://medium.com/@bioengineering.clarion/%D0%B3%D0%BE%D1%80%D0%BD-235420c0408a",
			"trello-link": "https://trello.com/b/uGMdwHLB/bioengineering-clarion",
			"trello-instruction-link": "https://medium.com/@bioengineering.clarion/public-task-management-system-e9e37ec70848"
		}
	}
	loadLocal();
	loadLocalLink();

});
